'''
1)  Вычислите среднее арифметическое чисел:

    а) (1 + 2 + 3 + 4 + 5) / 5 = 15 / 5 = 3

    б) (1 + 2 + 3 + 4 + 10) / 5 = 20 / 5 = 4

    в) (1 + 2 + 3 + 4 + 100) / 5 = 110 / 5 = 22

    г) (1 + 2 + 3 + 4 + 1000) / 5 = 1010 / 5 = 202

2)  Вычислите средние арифметические наборов чисел:

    а) (2 + 4 + 7 + 8 + 9) / 5 = 30 / 5 = 6

    б) (20 + 40 + 70 + 80 + 90) / 5 = 300 / 5 = 60

    в) (200 + 400 + 700 + 800 + 900) / 5 = 3000 / 5 = 600

    Какую закономерность можно наблюдать в поведении средних 
    значений в пунктах б) и в) по сравнению со средним в пункте а)?

    Числа в пунктах б) и в) получены из чисел в пункте а) 
    умножением на 10 и на 100.

3)  а) Средняя урожайность с 1992 по 1996 год:

    (18.0 + 17.1 + 15.3 + 13.1 + 14.9) / 5 = 78.4 / 5 = 15.68 ц/та

    б) Средняя урожайность с 1997 по 2001 год:

    (17.8 + 12.9 + 14.4 + 15.6 + 19.4) / 5 = 80.1 / 5 = 16.02 ц/та

    в) Разница (16.02 - 15.68) / 15.68 * 100 =~ 2.17 %

4)  а) 1992-2001 гг:

    Средняя урожайность: (18.0 + 17.1 + 15.3 + 13.1 + 14.9 + 17.8 + 12.9 + 14.4 + 15.6 + 19.4) / 10 = 159.5 / 10 = 15.95 ц/та

    Медиана: 12.9, 13.1, 14.4, 14.9, 15.3, 15.6, 17.1, 17.8, 18.0, 19.4 = 15.45 ц/та

    б) 1992-1996 гг:

    Средняя урожайность: (18.0 + 17.1 + 15.3 + 13.1 + 14.9) / 5 = 78.4 / 5 = 15.68 ц/та

    Медиана: 13.1, 14.9, 15.3, 17.1, 18.0 = 15.3 ц/та

    в) 1997-2001 гг:

    Средняя урожайность: (17.8 + 12.9 + 14.4 + 15.6 + 19.4) / 5 = 80.1 / 5 = 16.02 ц/та

    Медиана: 12.9, 14.4, 15.6, 17.8, 19.4 = 15.6 ц/та

    Сравните медиану и среднее. Насколько они отличаются друг от друга?

    В периоде 1992-2001 гг: Отклонение от среднего: 0.5 ц/та

    В периоде 1992-1996 гг: Отклонение от среднего: 0.38 ц/та

    В периоде 1997-2001 гг: Отклонение от среднего: 0.42 ц/та

5)  Дисперсия для набора чисел: 2, 3, 7, 1, 2, 3

    Среднее значение: (2 + 3 + 7 + 1 + 2 + 3) / 6 = 18 / 6 = 3

    Дисперсия: 
    ((2-3)^2 + (3-3)^2 + (7-3)^2 + (1-3)^2 + (2-3)^2 + (3-3)^2) / 6
    = (1 + 0 + 16 + 4 + 1 + 0) / 6 = 22 / 6 = 3.67

    Дисперсия для набора чисел: 2, 3, 4, 7, 1, 5, 6, 8

    Среднее значение: (2 + 3 + 4 + 7 + 1 + 5 + 6 + 8) / 8 = 36 / 8 = 4.5

    Дисперсия: ((2-4.5)^2 + (3-4.5)^2 + (4-4.5)^2 + (7-4.5)^2 + (1-4.5)^2 + (5-4.5)^2 + (6-4.5)^2 + (8-4.5)^2) / 8
    = (6.25 + 2.25 + 0.25 + 6.25 + 12.25 + 0.25 + 2.25 + 12.25) / 8 = 41.75 / 8 = 5.22

    Дисперсия (разброс) второго набора чисел больше, интересные вопросы
'''