'''
1. Оценка достоверности событий:

а) Невозможное
б) Невозможное
в) Достоверное
г) Невозможное
д) Достоверное
е) В России неврзможное

2. При 100 бросках монеты:

а) 5 раз - да
б) 50 раз - да
в) 90 раз - нет

3. При 600 бросках игральной кости ожидается выпадение шестерки около 100 раз.

4. При равновозможных элементарных событиях:

а) 1/25.
б) 1/17.
в) 1/100.

5. Для шахматной партии:

а) Вероятность, что Андрей не проиграет = 0.3 + 0.1 + 0.2 = 0.6
б) Вероятность, что Борис не проиграет => 1 =  0.6 + х = 0.4 (Боря вин)=> 0.4 + 0.2 + 0.1 = 0.7
в) Вероятность, что никто не выиграет = 0.3
'''
