"""
1.
    а) математическое ожидание для одной (1+2+3+4+5+6)/6 = 3.5
       Для 5 костей: 5 * 3.5 = 17.5.

    б) 7 * 3.5 = 24.5

    в) 100 * 3.5 = 350

    г) 3 * 3.5 = 10.5

2. Найдите E(Z), где:

    а) Z = X + Y
    E(Z) = E(X) + E(Y) = 3 + 4 = 7

    б) Z = X - Y
    E(Z) = E(X) - E(Y) = 3 - 4 = -1

    в) Z = 2X
    E(Z) = 2 * E(X) = 2 * 3 = 6

    г) Z = 3X + 2Y
    E(Z) = 3 * E(X) + 2 * E(Y) = 3 * 3 + 2 * 4 = 9 + 8 = 17

    д) Z = 2X - 3Y - 1
    E(Z) = 2 * E(X) - 3 * E(Y) - 1 = 2 * 3 - 3 * 4 - 1 = -7

    е) Z = 5 - 3X
    E(Z) = 5 - 3 * E(X) = 5 - 3 * 3 = 5 - 9 = -4

3. Найдите D(Y), где:

    а) Y = 3X
    D(Y) = (3^2) * D(X) = 9 * 3 = 27

    б) Y = X + 5
    D(Y) = D(X)

    в) Y = -4X
    D(Y) = ((-4)^2) * D(X) = 16 * 3 = 48

    г) Y = 2X - 1
    D(Y) = (2^2) * D(X) = 4 * 3 = 12

    д) Y = 5 - 3X
    D(Y) = ((-3)^2) * D(X) = 9 * 3 = 27

    е) Y = -5X - 7
    D(Y) = ((-5)^2) * D(X) = 25 * 3 = 75

4. Найдите дисперсию случайной величины:

    Для одной дисперсия равна (D(X) = (6^2 - (E(X))^2)/6 = 35/12 => для двух домножаем на 2 = 35/6 

5. 
    Пусть X - случайная величина, равная числу выпадений острием вверх

    E(X) = 135, а количество бросков n = 300

    Вероятность P(X) = E(X) / n = 135 / 300 = 9 / 20
"""